w7/controllers/IndexController.php

INSERT INTO `wx_num` (`w_name`, `w_appid`, `w_serveid`, `w_token`, `w_url`) VALUES ('对对对', '123243条5', '通话虽然天天骚扰或', '57882048da71c', 'http://www.hhy.com/index.php?token=57882048da71c')
---
    public function actionAddinfo(){
        $connection = Yii::$app->db;
        $request = Yii::$app->request;
    //生成url地址
    //生成token
        $num= $request->post();
        $num['w_token']= uniqid();
        $num['w_url']=$_SERVER['REQUEST_SCHEME'].'://'.$_SERVER['HTTP_HOST'].'/index.php?token='.$num['w_token'];
        $re=$connection->createCommand()->insert('wx_num',$num)->execute();

SELECT * FROM `wx_num`
---
    public function actionNumlist(){
        $query = WxNum::find()->all();

DELETE FROM `wx_num` WHERE `w_id`='16'
---
    public function actionDel_w(){

        $request = Yii::$app->request;
        $id= $request->get('w_id');       //接受要删除的id
        if(WxNum::deleteAll(['w_id'=>$id])){